[
  {
    "date": "10/11/2001",
    "time": "10:40 PM",
    "event": "\"It has the hallmarks of a hit\"",
    "description": "A gunman snuck through the backyard of a Queen Anne home, evading security lights to approach a basement window. Inside, Thomas Wales, a Seattle federal prosecutor and anti-gun violence advocate, worked on his computer. The gunman fired several shots at the unsuspecting Wales, killing him. Wales was survived by an adult son and daughter.\n\nFederal and local agencies launched an investigation into Wales’ death. If Wales was ultimately killed because of his work, he would be the first federal prosecutor in U.S. history to be slain in the line of duty.",
    "photo": "wales-mug.jpg",
    "link": "http://community.seattletimes.nwsource.com/archive/?date=20011012&slug=shooting12m"
  },
  {
    "date": "12/1/2001",
    "event": "A suspect emerges",
    "description": "Investigators turn their attention to an airline pilot that Wales had prosecuted in a bitterly fought fraud case involving a helicopter renovation. Agents search the pilot's Bellevue home."
  },
  {
    "date": "1/3/2002",
    "event": "Early doubts about the case",
    "description": "A Department of Justice source offered an early update about the investigation that has so far proven to be prescient: \"It may be that this is one of those cases where we are able to satify ourselves as to what happened, but never able to obtain charges.\"",
    "photo": "2002-article-thumb.jpg",
    "link": "./assets/2002-article.jpg"
  },
  {
    "date": "10/6/2002",
    "event": "Snakebit",
    "description": "Looking back at the Wales slaying after nearly a year, sources close to the investigation acknowledged organizational problems that had plagued the case from the start. Still, investigators had managed to eliminate dozens of potential suspects – but not the Bellevue pilot, who had emerged as the prime suspect.\n\nHowever, the evidence implicating the pilot – who had refused to be interrogated – was considered circumstantial. And the pilot’s supporters argued that he had been targeted by FBI agents who had bungled the case.\n",
    "link": "http://community.seattletimes.nwsource.com/archive/?date=20021006&slug=wales060"
  },
  {
    "date": "7/17/2003",
    "event": "The search for the gun barrels",
    "description": "Ballistics tests showed that the gunman who killed Wales had used a Makarov, an Eastern European-made semiautomatic pistol. And that particular Makarov had been fitted with a replacement barrel that left telltale marks on the bullets fired from the gun. Agents determined that roughly 3,500 of those replacement barrels had been sold.\n\nIn a nationwide hunt, agents set out to track down each one.\n",
    "photo": "makarov.jpg",
    "credit": "FBI archive",
    "link": "http://community.seattletimes.nwsource.com/archive/?date=20030717&slug=wales17"
  },
  {
    "date": "4/25/2004",
    "event": "27 boxes in Bellevue",
    "description": "FBI agents went to the Bellevue home of the prime suspect, the pilot Wales prosecuted, and took away 27 boxes of potential evidence. The pilot, who owned as many as eight guns at one time, was not present when the FBI searched his home.\n\nPat Adams, the special agent in charge of the Seattle FBI office at the time, said only counter-terrorism was more important to his office than solving Wales’ slaying.\n\n\"This particular case is something that has to be resolved,\" Adams said.\n",
    "photo": "search.jpg",
    "credit": "Steve Ringman / The Seattle Times",
    "link": "http://community.seattletimes.nwsource.com/archive/?date=20040426&slug=wales26m"
  },
  {
    "date": "1/23/2006",
    "event": "The anonymous letter",
    "description": "An envelope -- bearing the name \"Gidget\" over a return address from Las Vegas -- arrives at Seattle's FBI headquarters. Inside is a letter from a purported hit man who claims that a woman paid him to kill Wales.",
    "quote": "OK, so I was broke and between jobs I got an anonymous call offering [the amount was redacted by the F.B.I.] to shoot the guy, so I drove to Seattle to do the job. I did not even know his name. Just got laid off from a job. Nice talking lady, I didn’t know her name, she called me, talked to me by name, and asked if I needed some money. I agreed to pursue the matter, hell, I was going bankrupt. . . . \n\nI drove to the address, and then parked some distance away, north of downtown. I kind of camped out in the backyard of this house, and waited for the guy to settle in at his computer. Once he was there, I took careful aim. I shot two or possibly more times, and watched him collapse. I absurdly waited a few minutes and then left. I was sure he was dead. \n\nRetracing my steps, I dropped off the gun, found my money, and returned to Vegas. I feel bad about it, but I needed the money, and there were no witnesses.",
    "photo": "envelope.jpg",
    "credit": "FBI archive",
    "link": "http://community.seattletimes.nwsource.com/archive/?date=20060416&slug=letter16m"
  },
  {
    "date": "5/2/2006",
    "event": "Gidget and the pilot",
    "description": "Investigators disclose that their primary suspect, the Bellevue airline pilot, was in Las Vegas just three days before the anonymous \"Gidget\" letter was mailed from Las Vegas.",
    "link": "http://community.seattletimes.nwsource.com/archive/?date=20060502&slug=wales02m"
  },
  {
    "date": "7/13/2006",
    "event": "A new look",
    "description": "In a major rebuke, FBI officials in Washington, D.C., shift responsibility for the Wales investigation from Seattle to Portland. The move overturned a decision by the bureau's Seattle office to reduce the number of agents investigating the slaying. An FBI review committee also determined that supervisors in the Seattle office had failed to provide adequate direction in the case, leaving agents without resources and support, according to sources familiar with the investigation.",
    "link": "http://community.seattletimes.nwsource.com/archive/?date=20060614&slug=wales14m"
  },
  {
    "date": "10/11/2006",
    "event": "\"We will not give up\"",
    "description": "On the fifth anniversary, the FBI releases a sketch of a man they say was seen in Wales' neighborhood in the weeks before his slaying. ",
    "photo": "police-sketch.jpg",
    "credit": "FBI archive",
    "link": "http://www.seattletimes.com/seattle-news/fbi-releases-sketch-in-wales-killing/"
  },
  {
    "date": "12/7/2006",
    "event": "Wales' boss fired",
    "description": "John McKay, the U.S. Attorney for the Western District of Washington, is fired during the George W. Bush adminstration's controversial dismissal of seven U.S. Attorneys. Conflicting explanations for McKay's ouster come from the Department of Justice, including that he had criticized the way superiors were handling the Wales investigation.",
    "photo": "mckay.jpg",
    "credit": "Elaine Thompson / The Seattle Times",
    "link": "http://www.seattletimes.com/seattle-news/mckay-targeted-earlier-than-2006/"
  },
  {
    "date": "9/28/2011",
    "event": "10 years later",
    "description": "U.S. Attorney General Eric Holder joins Wales' two grown children to ask for the public's help in solving the decade-old slaying.",
    "video": "_r0TX2gbZio",
    "link": "http://o.seattletimes.nwsource.com/html/localnews/2016348383_wales29m.html"
  },
  {
    "date": "7/22/2014",
    "event": "“Ultimately, it’s about the rule of law\"",
    "description": "The newly appointed head of the Seattle FBI office says there is “momentum” in the 13-year-old Wales investigation, shortly after the case is returned to his office.",
    "link": "http://www.seattletimes.com/seattle-news/new-seattle-fbi-chief-sees-progress-in-wales-investigation/"
  }
]